RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32F5xx_Firmware_Library/GD32F5xx_standard_peripheral/Include/gd32f5xx_fmc.h
/*!
    \file    gd32f5xx_fmc.h
    \brief   definitions for the FMC

    \version 2024-07-31, V1.1.0, firmware for GD32F5xx
*/

/*
    Copyright (c) 2024, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/


#ifndef GD32F5XX_FMC_H
#define GD32F5XX_FMC_H

#include "gd32f5xx.h"

/* FMC and option byte definition */
#define FMC                            FMC_BASE                                        /*!< FMC register base address */
#define OB                             OB_BASE                                         /*!< option byte base address */

/* registers definitions */
#define FMC_KEY                        REG32((FMC) + 0x00000004U)                      /*!< FMC unlock key register */
#define FMC_OBKEY                      REG32((FMC) + 0x00000008U)                      /*!< FMC option byte unlock key register */
#define FMC_STAT                       REG32((FMC) + 0x0000000CU)                      /*!< FMC status register */
#define FMC_CTL                        REG32((FMC) + 0x00000010U)                      /*!< FMC control register */
#define FMC_OBCTL0                     REG32((FMC) + 0x00000014U)                      /*!< FMC option byte control register 0 */
#define FMC_OBCTL1                     REG32((FMC) + 0x00000018U)                      /*!< FMC option byte control register 1 */
#define FMC_PECFG                      REG32((FMC) + 0x00000020U)                      /*!< FMC page erase configuration register */
#define FMC_PEKEY                      REG32((FMC) + 0x00000024U)                      /*!< FMC unlock page erase key register */
#define FMC_OTP1CFG                    REG32((FMC) + 0x00000028U)                      /*!< FMC OTP1 configuration register */
#define FMC_LDECCADDR0                 REG32((FMC) + 0x0000002CU)                      /*!< FMC two bits ECC error address0 when load code from flash/bootloader/OTP1 */
#define FMC_LDECCADDR1                 REG32((FMC) + 0x00000030U)                      /*!< FMC two bits ECC error address1 when load code from flash/bootloader/OTP1 */
#define FMC_LDECCADDR2                 REG32((FMC) + 0x00000034U)                      /*!< FMC two bits ECC error address2 when load code from flash/bootloader/OTP1 */
#define FMC_OBSTAT                     REG32((FMC) + 0x00000040U)                      /*!< FMC option bytes status register */
#define FMC_PID                        REG32((FMC) + 0x00000100U)                      /*!< FMC product ID register */
#define EFUSE_CS                       REG32((FMC) + 0x00000200U)                      /*!< EFUSE control and status register */
#define EFUSE_ADDR                     REG32((FMC) + 0x00000204U)                      /*!< EFUSE address register */
#define EFUSE_CTL                      REG32((FMC) + 0x00000208U)                      /*!< EFUSE efuse controlregister */
#define EFUSE_USER_DATA                REG32((FMC) + 0x0000020CU)                      /*!< EFUSE user data register */

#define OB_USER                        REG8((OB) + 0x00010000U)                        /*!< option byte user value*/
#define OB_SPC                         REG8((OB) + 0x00010001U)                        /*!< option byte security protection value */
#define OB_WP0_0                       REG8((OB) + 0x00010008U)                        /*!< option byte write protection 0 */
#define OB_WP0_1                       REG8((OB) + 0x00010009U)                        /*!< option byte write protection 0 */
#define OB_WP0_2                       REG8((OB) + 0x0001000CU)                        /*!< option byte write protection 0 */
#define OB_WP1_0                       REG8((OB) + 0x00000008U)                        /*!< option byte write protection 1 */
#define OB_WP1_1                       REG8((OB) + 0x00000009U)                        /*!< option byte write protection 1 */
#define OB_WP1_2                       REG8((OB) + 0x0000000CU)                        /*!< option byte write protection 1 */

/* registers offset */
#define EFUSE_CTL_OFFSET               ((uint32_t)0x00000208U)                         /*!< EFUSE efuse control register offset */
#define EFUSE_USER_DATA_OFFSET         ((uint32_t)0x0000020CU)                         /*!< EFUSE user data register offset */

/* bits definitions */
/* FMC_KEY */
#define FMC_KEY_KEY                    BITS(0,31)                                      /*!< FMC main flash key bits */

/* FMC_OBKEY */
#define FMC_OBKEY_OBKEY                BITS(0,31)                                      /*!< option byte key bits */

